hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_venc.h
/*
; stm32N657_venc.
; ===============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_venc equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// VENC address definitions
// ------------------------

typedef struct {
	volatile	uint32_t	SWREG0;
	volatile	uint32_t	SWREG1;
	volatile	uint32_t	SWREG2;
	volatile	uint32_t	SWREG3;
	volatile	uint32_t	RESERVED0;
	volatile	uint32_t	SWREG5;
	volatile	uint32_t	SWREG6;
	volatile	uint32_t	SWREG7;
	volatile	uint32_t	SWREG8;
	volatile	uint32_t	SWREG9;
	volatile	uint32_t	SWREG10;
	volatile	uint32_t	SWREG11;
	volatile	uint32_t	SWREG12;
	volatile	uint32_t	SWREG13;
	volatile	uint32_t	SWREG14;
	volatile	uint32_t	SWREG15;
	volatile	uint32_t	SWREG16;
	volatile	uint32_t	SWREG17;
	volatile	uint32_t	SWREG18;
	volatile	uint32_t	SWREG19;
	volatile	uint32_t	SWREG20;
	volatile	uint32_t	SWREG21;
	volatile	uint32_t	SWREG22;
	volatile	uint32_t	SWREG23;
	volatile	uint32_t	SWREG24;
	volatile	uint32_t	SWREG25;
	volatile	uint32_t	SWREG26;
	volatile	uint32_t	SWREG27;
	volatile	uint32_t	SWREG28;
	volatile	uint32_t	SWREG29;
	volatile	uint32_t	SWREG30;
	volatile	uint32_t	SWREG31;
	volatile	uint32_t	SWREG32;
	volatile	uint32_t	SWREG33;
	volatile	uint32_t	SWREG34;
	volatile	uint32_t	SWREG35;
	volatile	uint32_t	SWREG36;
	volatile	uint32_t	SWREG37;
	volatile	uint32_t	SWREG38;
	volatile	uint32_t	SWREG39;
	volatile	uint32_t	SWREG40;
	volatile	uint32_t	SWREG41;
	volatile	uint32_t	SWREG42;
	volatile	uint32_t	SWREG43;
	volatile	uint32_t	SWREG44;
	volatile	uint32_t	SWREG45;
	volatile	uint32_t	SWREG46;
	volatile	uint32_t	SWREG47;
	volatile	uint32_t	SWREG48;
	volatile	uint32_t	SWREG49;
	volatile	uint32_t	SWREG50;
	volatile	uint32_t	SWREG51;
	volatile	uint32_t	SWREG52;
	volatile	uint32_t	SWREG53;
	volatile	uint32_t	SWREG54;
	volatile	uint32_t	SWREG55;
	volatile	uint32_t	SWREG56;
	volatile	uint32_t	SWREG57;
	volatile	uint32_t	SWREG58;
	volatile	uint32_t	SWREG59;
	volatile	uint32_t	SWREG60;
	volatile	uint32_t	SWREG61;
	volatile	uint32_t	SWREG62;
	volatile	uint32_t	SWREG63;
	volatile	uint32_t	SWREG64;
	volatile	uint32_t	SWREG65;
	volatile	uint32_t	SWREG66;
	volatile	uint32_t	SWREG67;
	volatile	uint32_t	SWREG68;
	volatile	uint32_t	SWREG69;
	volatile	uint32_t	SWREG70;
	volatile	uint32_t	SWREG71;
	volatile	uint32_t	SWREG72;
	volatile	uint32_t	SWREG73;
	volatile	uint32_t	SWREG74;
	volatile	uint32_t	SWREG75;
	volatile	uint32_t	SWREG76;
	volatile	uint32_t	SWREG77;
	volatile	uint32_t	SWREG78;
	volatile	uint32_t	SWREG79;
	volatile	uint32_t	SWREG80;
	volatile	uint32_t	SWREG81;
	volatile	uint32_t	SWREG82;
	volatile	uint32_t	SWREG83;
	volatile	uint32_t	SWREG84;
	volatile	uint32_t	SWREG85;
	volatile	uint32_t	SWREG86;
	volatile	uint32_t	SWREG87;
	volatile	uint32_t	SWREG88;
	volatile	uint32_t	SWREG89;
	volatile	uint32_t	SWREG90;
	volatile	uint32_t	SWREG91;
	volatile	uint32_t	SWREG92;
	volatile	uint32_t	SWREG93;
	volatile	uint32_t	SWREG94;
	volatile	uint32_t	SWREG95;
	volatile	uint32_t	SWREG96;
	volatile	uint32_t	SWREG97;
	volatile	uint32_t	SWREG98;
	volatile	uint32_t	SWREG99;
	volatile	uint32_t	SWREG100;
	volatile	uint32_t	SWREG101;
	volatile	uint32_t	SWREG102;
	volatile	uint32_t	SWREG103;
	volatile	uint32_t	SWREG104;
	volatile	uint32_t	SWREG105;
	volatile	uint32_t	SWREG106;
	volatile	uint32_t	SWREG107;
	volatile	uint32_t	SWREG108;
	volatile	uint32_t	SWREG109;
	volatile	uint32_t	SWREG110;
	volatile	uint32_t	SWREG111;
	volatile	uint32_t	SWREG112;
	volatile	uint32_t	SWREG113;
	volatile	uint32_t	SWREG114;
	volatile	uint32_t	SWREG115;
	volatile	uint32_t	SWREG116;
	volatile	uint32_t	SWREG117;
	volatile	uint32_t	SWREG118;
	volatile	uint32_t	SWREG119;
	volatile	uint32_t	SWREG120;
	volatile	uint32_t	SWREG121;
	volatile	uint32_t	SWREG122;
	volatile	uint32_t	SWREG123;
	volatile	uint32_t	SWREG124;
	volatile	uint32_t	SWREG125;
	volatile	uint32_t	SWREG126;
	volatile	uint32_t	SWREG127;
	volatile	uint32_t	SWREG128;
	volatile	uint32_t	SWREG129;
	volatile	uint32_t	SWREG130;
	volatile	uint32_t	SWREG131;
	volatile	uint32_t	SWREG132;
	volatile	uint32_t	SWREG133;
	volatile	uint32_t	SWREG134;
	volatile	uint32_t	SWREG135;
	volatile	uint32_t	SWREG136;
	volatile	uint32_t	SWREG137;
	volatile	uint32_t	SWREG138;
	volatile	uint32_t	SWREG139;
	volatile	uint32_t	SWREG140;
	volatile	uint32_t	SWREG141;
	volatile	uint32_t	SWREG142;
	volatile	uint32_t	SWREG143;
	volatile	uint32_t	SWREG144;
	volatile	uint32_t	SWREG145;
	volatile	uint32_t	SWREG146;
	volatile	uint32_t	SWREG147;
	volatile	uint32_t	SWREG148;
	volatile	uint32_t	SWREG149;
	volatile	uint32_t	SWREG150;
	volatile	uint32_t	SWREG151;
	volatile	uint32_t	SWREG152;
	volatile	uint32_t	SWREG153;
	volatile	uint32_t	SWREG154;
	volatile	uint32_t	SWREG155;
	volatile	uint32_t	SWREG156;
	volatile	uint32_t	SWREG157;
	volatile	uint32_t	SWREG158;
	volatile	uint32_t	SWREG159;
	volatile	uint32_t	RESERVED1[71];
	volatile	uint32_t	SWREG231;
	volatile	uint32_t	SWREG232;
	volatile	uint32_t	SWREG233;
	volatile	uint32_t	RESERVED2[2];
	volatile	uint32_t	SWREG236;
	volatile	uint32_t	SWREG237;
	volatile	uint32_t	SWREG238;
	volatile	uint32_t	RESERVED3[17];
	volatile	uint32_t	SWREG256;
	volatile	uint32_t	SWREG257;
	volatile	uint32_t	SWREG258;
	volatile	uint32_t	SWREG259;
	volatile	uint32_t	SWREG260;
	volatile	uint32_t	SWREG261;
	volatile	uint32_t	SWREG262;
	volatile	uint32_t	SWREG263;
	volatile	uint32_t	SWREG264;
	volatile	uint32_t	SWREG265;
	volatile	uint32_t	SWREG266;
	volatile	uint32_t	SWREG267;
	volatile	uint32_t	SWREG268;
	volatile	uint32_t	SWREG269;
	volatile	uint32_t	SWREG270;
	volatile	uint32_t	SWREG271;
	volatile	uint32_t	SWREG272;
	volatile	uint32_t	SWREG273;
	volatile	uint32_t	SWREG274;
	volatile	uint32_t	SWREG275;
	volatile	uint32_t	SWREG276;
	volatile	uint32_t	SWREG277;
	volatile	uint32_t	SWREG278;
	volatile	uint32_t	SWREG279;
	volatile	uint32_t	SWREG280;
	volatile	uint32_t	SWREG281;
	volatile	uint32_t	SWREG282;
	volatile	uint32_t	SWREG283;
	volatile	uint32_t	SWREG284;
	volatile	uint32_t	SWREG285;
	volatile	uint32_t	SWREG286;
	volatile	uint32_t	SWREG287;
	volatile	uint32_t	SWREG288;
	volatile	uint32_t	SWREG289;
	volatile	uint32_t	SWREG290;
	volatile	uint32_t	SWREG291;
	volatile	uint32_t	RESERVED4[2];
	volatile	uint32_t	SWREG294;
	volatile	uint32_t	SWREG295;
	volatile	uint32_t	SWREG296;
	volatile	uint32_t	SWREG297;
	volatile	uint32_t	SWREG298;
	volatile	uint32_t	SWREG299;
	volatile	uint32_t	SWREG300;
	volatile	uint32_t	SWREG301;
	volatile	uint32_t	SWREG302;
	volatile	uint32_t	SWREG303;
	volatile	uint32_t	SWREG304;
	volatile	uint32_t	SWREG305;
	volatile	uint32_t	SWREG306;
	volatile	uint32_t	SWREG307;
	volatile	uint32_t	SWREG308;
	volatile	uint32_t	SWREG309;
	volatile	uint32_t	SWREG310;
	volatile	uint32_t	SWREG311;
	volatile	uint32_t	SWREG312;
	volatile	uint32_t	SWREG313;
	volatile	uint32_t	SWREG314;
	volatile	uint32_t	SWREG315;
	volatile	uint32_t	SWREG316;
	volatile	uint32_t	SWREG317;
	volatile	uint32_t	SWREG318;
	volatile	uint32_t	SWREG319;
	volatile	uint32_t	SWREG320;
	volatile	uint32_t	SWREG321;
	volatile	uint32_t	SWREG322;
	volatile	uint32_t	SWREG323;
	volatile	uint32_t	SWREG324;
	volatile	uint32_t	SWREG325;
	volatile	uint32_t	SWREG326;
	volatile	uint32_t	SWREG327;
	volatile	uint32_t	SWREG328;
	volatile	uint32_t	SWREG329;
	volatile	uint32_t	SWREG330;
	volatile	uint32_t	SWREG331;
	volatile	uint32_t	SWREG332;
	volatile	uint32_t	SWREG333;
	volatile	uint32_t	SWREG334;
	volatile	uint32_t	SWREG335;
	volatile	uint32_t	SWREG336;
	volatile	uint32_t	SWREG337;
	volatile	uint32_t	SWREG338;
	volatile	uint32_t	SWREG339;
	volatile	uint32_t	SWREG340;
	volatile	uint32_t	SWREG341;
	volatile	uint32_t	SWREG342;
	volatile	uint32_t	SWREG343;
	volatile	uint32_t	SWREG344;
	volatile	uint32_t	SWREG345;
	volatile	uint32_t	SWREG346;
	volatile	uint32_t	SWREG347;
	volatile	uint32_t	SWREG348;
	volatile	uint32_t	SWREG349;
	volatile	uint32_t	SWREG350;
	volatile	uint32_t	SWREG351;
	volatile	uint32_t	SWREG352;
	volatile	uint32_t	SWREG353;
	volatile	uint32_t	SWREG354;
	volatile	uint32_t	SWREG355;
	volatile	uint32_t	SWREG356;
	volatile	uint32_t	SWREG357;
	volatile	uint32_t	SWREG358;
	volatile	uint32_t	SWREG359;
	volatile	uint32_t	SWREG360;
	volatile	uint32_t	SWREG361;
	volatile	uint32_t	SWREG362;
	volatile	uint32_t	SWREG363;
	volatile	uint32_t	SWREG364;
	volatile	uint32_t	SWREG365;
	volatile	uint32_t	SWREG366;
	volatile	uint32_t	SWREG367;
	volatile	uint32_t	SWREG368;
	volatile	uint32_t	SWREG369;
	volatile	uint32_t	SWREG370;
	volatile	uint32_t	SWREG371;
	volatile	uint32_t	SWREG372;
	volatile	uint32_t	SWREG373;
	volatile	uint32_t	SWREG374;
	volatile	uint32_t	SWREG375;
	volatile	uint32_t	SWREG376;
	volatile	uint32_t	SWREG377;
	volatile	uint32_t	SWREG378;
	volatile	uint32_t	SWREG379;
	volatile	uint32_t	SWREG380;
	volatile	uint32_t	SWREG381;
	volatile	uint32_t	SWREG382;
	volatile	uint32_t	SWREG383;
	volatile	uint32_t	SWREG384;
	volatile	uint32_t	SWREG385;
	volatile	uint32_t	SWREG386;
	volatile	uint32_t	SWREG387;
	volatile	uint32_t	SWREG388;
	volatile	uint32_t	SWREG389;
	volatile	uint32_t	SWREG390;
	volatile	uint32_t	SWREG391;
	volatile	uint32_t	SWREG392;
	volatile	uint32_t	SWREG393;
	volatile	uint32_t	SWREG394;
	volatile	uint32_t	SWREG395;
	volatile	uint32_t	SWREG396;
	volatile	uint32_t	SWREG397;
	volatile	uint32_t	SWREG398;
	volatile	uint32_t	SWREG399;
	volatile	uint32_t	SWREG400;
	volatile	uint32_t	SWREG401;
	volatile	uint32_t	SWREG402;
	volatile	uint32_t	SWREG403;
	volatile	uint32_t	SWREG404;
	volatile	uint32_t	SWREG405;
	volatile	uint32_t	SWREG406;
	volatile	uint32_t	SWREG407;
	volatile	uint32_t	SWREG408;
	volatile	uint32_t	SWREG409;
	volatile	uint32_t	SWREG410;
	volatile	uint32_t	SWREG411;
	volatile	uint32_t	SWREG412;
	volatile	uint32_t	SWREG413;
	volatile	uint32_t	SWREG414;
	volatile	uint32_t	SWREG415;
	volatile	uint32_t	SWREG416;
	volatile	uint32_t	SWREG417;
	volatile	uint32_t	SWREG418;
	volatile	uint32_t	SWREG419;
	volatile	uint32_t	SWREG420;
	volatile	uint32_t	SWREG421;
	volatile	uint32_t	SWREG422;
	volatile	uint32_t	SWREG423;
	volatile	uint32_t	SWREG424;
	volatile	uint32_t	SWREG425;
	volatile	uint32_t	SWREG426;
	volatile	uint32_t	SWREG427;
	volatile	uint32_t	SWREG428;
	volatile	uint32_t	SWREG429;
	volatile	uint32_t	SWREG430;
	volatile	uint32_t	SWREG431;
	volatile	uint32_t	SWREG432;
	volatile	uint32_t	SWREG433;
	volatile	uint32_t	SWREG434;
	volatile	uint32_t	SWREG435;
	volatile	uint32_t	SWREG436;
	volatile	uint32_t	SWREG437;
	volatile	uint32_t	SWREG438;
	volatile	uint32_t	SWREG439;
	volatile	uint32_t	SWREG440;
	volatile	uint32_t	SWREG441;
	volatile	uint32_t	SWREG442;
	volatile	uint32_t	SWREG443;
	volatile	uint32_t	SWREG444;
	volatile	uint32_t	RESERVED5[4];
	volatile	uint32_t	SWREG449;
	volatile	uint32_t	RESERVED6[47];
	volatile	uint32_t	SWREG497;
	volatile	uint32_t	SWREG498;
} VENC_TypeDef;

#if (defined(__cplusplus))
#define	VENC_NS	reinterpret_cast<VENC_TypeDef *>(0x48005000u)
#define	VENC_S	reinterpret_cast<VENC_TypeDef *>(0x58005000u)

#else
#define	VENC_NS	((VENC_TypeDef *)0x48005000u)
#define	VENC_S	((VENC_TypeDef *)0x58005000u)
#endif

// SWREG0 Configuration

#define	VENC_SWREG0_SWREG_FIELD		(0xFFFFFFFFu<<0)
#define	VENC_SWREG0_SWREG_FIELD_0	(0x1u<<0)

// SWREG1 Configuration

#define	VENC_SWREG1_SWREG_FIELD		(0xFFFFFFFFu<<0)
#define	VENC_SWREG1_SWREG_FIELD_0	(0x1u<<0)

// SWREG2 Configuration

