hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_venc.h
#define	VENC_SWREG2_SWREG_FIELD		(0xFFFFFFFFu<<0)
#define	VENC_SWREG2_SWREG_FIELD_0	(0x1u<<0)

// SWREG3 Configuration

#define	VENC_SWREG3_SWREG_FIELD		(0xFFFFFFFFu<<0)
#define	VENC_SWREG3_SWREG_FIELD_0	(0x1u<<0)

// SWREG5 Configuration

#define	VENC_SWREG5_SWREG_FIELD		(0xFFFFFFFFu<<0)
#define	VENC_SWREG5_SWREG_FIELD_0	(0x1u<<0)

// SWREG6 Configuration

#define	VENC_SWREG6_SWREG_FIELD		(0xFFFFFFFFu<<0)
#define	VENC_SWREG6_SWREG_FIELD_0	(0x1u<<0)

// SWREG7 Configuration

#define	VENC_SWREG7_SWREG_FIELD		(0xFFFFFFFFu<<0)
#define	VENC_SWREG7_SWREG_FIELD_0	(0x1u<<0)

// SWREG8 Configuration

#define	VENC_SWREG8_SWREG_FIELD		(0xFFFFFFFFu<<0)
#define	VENC_SWREG8_SWREG_FIELD_0	(0x1u<<0)

// SWREG9 Configuration

#define	VENC_SWREG9_SWREG_FIELD		(0xFFFFFFFFu<<0)
#define	VENC_SWREG9_SWREG_FIELD_0	(0x1u<<0)

// SWREG10 Configuration

#define	VENC_SWREG10_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG10_SWREG_FIELD_0	(0x1u<<0)

// SWREG11 Configuration

#define	VENC_SWREG11_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG11_SWREG_FIELD_0	(0x1u<<0)

// SWREG12 Configuration

#define	VENC_SWREG12_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG12_SWREG_FIELD_0	(0x1u<<0)

// SWREG13 Configuration

#define	VENC_SWREG13_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG13_SWREG_FIELD_0	(0x1u<<0)

// SWREG14 Configuration

#define	VENC_SWREG14_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG14_SWREG_FIELD_0	(0x1u<<0)

// SWREG15 Configuration

#define	VENC_SWREG15_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG15_SWREG_FIELD_0	(0x1u<<0)

// SWREG16 Configuration

#define	VENC_SWREG16_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG16_SWREG_FIELD_0	(0x1u<<0)

// SWREG17 Configuration

#define	VENC_SWREG17_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG17_SWREG_FIELD_0	(0x1u<<0)

// SWREG18 Configuration

#define	VENC_SWREG18_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG18_SWREG_FIELD_0	(0x1u<<0)

// SWREG19 Configuration

#define	VENC_SWREG19_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG19_SWREG_FIELD_0	(0x1u<<0)

// SWREG20 Configuration

#define	VENC_SWREG20_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG20_SWREG_FIELD_0	(0x1u<<0)

// SWREG21 Configuration

#define	VENC_SWREG21_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG21_SWREG_FIELD_0	(0x1u<<0)

// SWREG22 Configuration

#define	VENC_SWREG22_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG22_SWREG_FIELD_0	(0x1u<<0)

// SWREG23 Configuration

#define	VENC_SWREG23_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG23_SWREG_FIELD_0	(0x1u<<0)

// SWREG24 Configuration

#define	VENC_SWREG24_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG24_SWREG_FIELD_0	(0x1u<<0)

// SWREG25 Configuration

#define	VENC_SWREG25_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG25_SWREG_FIELD_0	(0x1u<<0)

// SWREG26 Configuration

#define	VENC_SWREG26_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG26_SWREG_FIELD_0	(0x1u<<0)

// SWREG27 Configuration

#define	VENC_SWREG27_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG27_SWREG_FIELD_0	(0x1u<<0)

// SWREG28 Configuration

#define	VENC_SWREG28_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG28_SWREG_FIELD_0	(0x1u<<0)

// SWREG29 Configuration

#define	VENC_SWREG29_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG29_SWREG_FIELD_0	(0x1u<<0)

// SWREG30 Configuration

#define	VENC_SWREG30_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG30_SWREG_FIELD_0	(0x1u<<0)

// SWREG31 Configuration

#define	VENC_SWREG31_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG31_SWREG_FIELD_0	(0x1u<<0)

// SWREG32 Configuration

#define	VENC_SWREG32_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG32_SWREG_FIELD_0	(0x1u<<0)

// SWREG33 Configuration

#define	VENC_SWREG33_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG33_SWREG_FIELD_0	(0x1u<<0)

// SWREG34 Configuration

#define	VENC_SWREG34_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG34_SWREG_FIELD_0	(0x1u<<0)

// SWREG35 Configuration

#define	VENC_SWREG35_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG35_SWREG_FIELD_0	(0x1u<<0)

// SWREG36 Configuration

#define	VENC_SWREG36_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG36_SWREG_FIELD_0	(0x1u<<0)

// SWREG37 Configuration

#define	VENC_SWREG37_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG37_SWREG_FIELD_0	(0x1u<<0)

// SWREG38 Configuration

#define	VENC_SWREG38_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG38_SWREG_FIELD_0	(0x1u<<0)

// SWREG39 Configuration

#define	VENC_SWREG39_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG39_SWREG_FIELD_0	(0x1u<<0)

// SWREG40 Configuration

#define	VENC_SWREG40_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG40_SWREG_FIELD_0	(0x1u<<0)

// SWREG41 Configuration

#define	VENC_SWREG41_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG41_SWREG_FIELD_0	(0x1u<<0)

// SWREG42 Configuration

#define	VENC_SWREG42_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG42_SWREG_FIELD_0	(0x1u<<0)

// SWREG43 Configuration

#define	VENC_SWREG43_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG43_SWREG_FIELD_0	(0x1u<<0)

// SWREG44 Configuration

#define	VENC_SWREG44_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG44_SWREG_FIELD_0	(0x1u<<0)

// SWREG45 Configuration

#define	VENC_SWREG45_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG45_SWREG_FIELD_0	(0x1u<<0)

// SWREG46 Configuration

#define	VENC_SWREG46_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG46_SWREG_FIELD_0	(0x1u<<0)

// SWREG47 Configuration

#define	VENC_SWREG47_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG47_SWREG_FIELD_0	(0x1u<<0)

// SWREG48 Configuration

#define	VENC_SWREG48_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG48_SWREG_FIELD_0	(0x1u<<0)

// SWREG49 Configuration

#define	VENC_SWREG49_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG49_SWREG_FIELD_0	(0x1u<<0)

// SWREG50 Configuration

#define	VENC_SWREG50_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG50_SWREG_FIELD_0	(0x1u<<0)

// SWREG51 Configuration

#define	VENC_SWREG51_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG51_SWREG_FIELD_0	(0x1u<<0)

// SWREG52 Configuration

#define	VENC_SWREG52_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG52_SWREG_FIELD_0	(0x1u<<0)

