hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_venc.h
// SWREG53 Configuration

#define	VENC_SWREG53_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG53_SWREG_FIELD_0	(0x1u<<0)

// SWREG54 Configuration

#define	VENC_SWREG54_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG54_SWREG_FIELD_0	(0x1u<<0)

// SWREG55 Configuration

#define	VENC_SWREG55_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG55_SWREG_FIELD_0	(0x1u<<0)

// SWREG56 Configuration

#define	VENC_SWREG56_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG56_SWREG_FIELD_0	(0x1u<<0)

// SWREG57 Configuration

#define	VENC_SWREG57_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG57_SWREG_FIELD_0	(0x1u<<0)

// SWREG58 Configuration

#define	VENC_SWREG58_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG58_SWREG_FIELD_0	(0x1u<<0)

// SWREG59 Configuration

#define	VENC_SWREG59_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG59_SWREG_FIELD_0	(0x1u<<0)

// SWREG60 Configuration

#define	VENC_SWREG60_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG60_SWREG_FIELD_0	(0x1u<<0)

// SWREG61 Configuration

#define	VENC_SWREG61_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG61_SWREG_FIELD_0	(0x1u<<0)

// SWREG62 Configuration

#define	VENC_SWREG62_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG62_SWREG_FIELD_0	(0x1u<<0)

// SWREG63 Configuration

#define	VENC_SWREG63_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG63_SWREG_FIELD_0	(0x1u<<0)

// SWREG64 Configuration

#define	VENC_SWREG64_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG64_SWREG_FIELD_0	(0x1u<<0)

// SWREG65 Configuration

#define	VENC_SWREG65_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG65_SWREG_FIELD_0	(0x1u<<0)

// SWREG66 Configuration

#define	VENC_SWREG66_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG66_SWREG_FIELD_0	(0x1u<<0)

// SWREG67 Configuration

#define	VENC_SWREG67_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG67_SWREG_FIELD_0	(0x1u<<0)

// SWREG68 Configuration

#define	VENC_SWREG68_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG68_SWREG_FIELD_0	(0x1u<<0)

// SWREG69 Configuration

#define	VENC_SWREG69_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG69_SWREG_FIELD_0	(0x1u<<0)

// SWREG70 Configuration

#define	VENC_SWREG70_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG70_SWREG_FIELD_0	(0x1u<<0)

// SWREG71 Configuration

#define	VENC_SWREG71_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG71_SWREG_FIELD_0	(0x1u<<0)

// SWREG72 Configuration

#define	VENC_SWREG72_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG72_SWREG_FIELD_0	(0x1u<<0)

// SWREG73 Configuration

#define	VENC_SWREG73_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG73_SWREG_FIELD_0	(0x1u<<0)

// SWREG74 Configuration

#define	VENC_SWREG74_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG74_SWREG_FIELD_0	(0x1u<<0)

// SWREG75 Configuration

#define	VENC_SWREG75_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG75_SWREG_FIELD_0	(0x1u<<0)

// SWREG76 Configuration

#define	VENC_SWREG76_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG76_SWREG_FIELD_0	(0x1u<<0)

// SWREG77 Configuration

#define	VENC_SWREG77_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG77_SWREG_FIELD_0	(0x1u<<0)

// SWREG78 Configuration

#define	VENC_SWREG78_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG78_SWREG_FIELD_0	(0x1u<<0)

// SWREG79 Configuration

#define	VENC_SWREG79_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG79_SWREG_FIELD_0	(0x1u<<0)

// SWREG80 Configuration

#define	VENC_SWREG80_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG80_SWREG_FIELD_0	(0x1u<<0)

// SWREG81 Configuration

#define	VENC_SWREG81_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG81_SWREG_FIELD_0	(0x1u<<0)

// SWREG82 Configuration

#define	VENC_SWREG82_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG82_SWREG_FIELD_0	(0x1u<<0)

// SWREG83 Configuration

#define	VENC_SWREG83_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG83_SWREG_FIELD_0	(0x1u<<0)

// SWREG84 Configuration

#define	VENC_SWREG84_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG84_SWREG_FIELD_0	(0x1u<<0)

// SWREG85 Configuration

#define	VENC_SWREG85_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG85_SWREG_FIELD_0	(0x1u<<0)

// SWREG86 Configuration

#define	VENC_SWREG86_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG86_SWREG_FIELD_0	(0x1u<<0)

// SWREG87 Configuration

#define	VENC_SWREG87_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG87_SWREG_FIELD_0	(0x1u<<0)

// SWREG88 Configuration

#define	VENC_SWREG88_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG88_SWREG_FIELD_0	(0x1u<<0)

// SWREG89 Configuration

#define	VENC_SWREG89_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG89_SWREG_FIELD_0	(0x1u<<0)

// SWREG90 Configuration

#define	VENC_SWREG90_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG90_SWREG_FIELD_0	(0x1u<<0)

// SWREG91 Configuration

#define	VENC_SWREG91_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG91_SWREG_FIELD_0	(0x1u<<0)

// SWREG92 Configuration

#define	VENC_SWREG92_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG92_SWREG_FIELD_0	(0x1u<<0)

// SWREG93 Configuration

#define	VENC_SWREG93_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG93_SWREG_FIELD_0	(0x1u<<0)

// SWREG94 Configuration

#define	VENC_SWREG94_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG94_SWREG_FIELD_0	(0x1u<<0)

// SWREG95 Configuration

#define	VENC_SWREG95_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG95_SWREG_FIELD_0	(0x1u<<0)

// SWREG96 Configuration

#define	VENC_SWREG96_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG96_SWREG_FIELD_0	(0x1u<<0)

// SWREG97 Configuration

#define	VENC_SWREG97_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG97_SWREG_FIELD_0	(0x1u<<0)

// SWREG98 Configuration

#define	VENC_SWREG98_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG98_SWREG_FIELD_0	(0x1u<<0)

// SWREG99 Configuration

#define	VENC_SWREG99_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG99_SWREG_FIELD_0	(0x1u<<0)

// SWREG100 Configuration

#define	VENC_SWREG100_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG100_SWREG_FIELD_0	(0x1u<<0)

// SWREG101 Configuration

#define	VENC_SWREG101_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG101_SWREG_FIELD_0	(0x1u<<0)

// SWREG102 Configuration

#define	VENC_SWREG102_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG102_SWREG_FIELD_0	(0x1u<<0)

// SWREG103 Configuration

#define	VENC_SWREG103_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG103_SWREG_FIELD_0	(0x1u<<0)

