hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_venc.h
// SWREG104 Configuration

#define	VENC_SWREG104_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG104_SWREG_FIELD_0	(0x1u<<0)

// SWREG105 Configuration

#define	VENC_SWREG105_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG105_SWREG_FIELD_0	(0x1u<<0)

// SWREG106 Configuration

#define	VENC_SWREG106_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG106_SWREG_FIELD_0	(0x1u<<0)

// SWREG107 Configuration

#define	VENC_SWREG107_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG107_SWREG_FIELD_0	(0x1u<<0)

// SWREG108 Configuration

#define	VENC_SWREG108_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG108_SWREG_FIELD_0	(0x1u<<0)

// SWREG109 Configuration

#define	VENC_SWREG109_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG109_SWREG_FIELD_0	(0x1u<<0)

// SWREG110 Configuration

#define	VENC_SWREG110_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG110_SWREG_FIELD_0	(0x1u<<0)

// SWREG111 Configuration

#define	VENC_SWREG111_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG111_SWREG_FIELD_0	(0x1u<<0)

// SWREG112 Configuration

#define	VENC_SWREG112_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG112_SWREG_FIELD_0	(0x1u<<0)

// SWREG113 Configuration

#define	VENC_SWREG113_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG113_SWREG_FIELD_0	(0x1u<<0)

// SWREG114 Configuration

#define	VENC_SWREG114_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG114_SWREG_FIELD_0	(0x1u<<0)

// SWREG115 Configuration

#define	VENC_SWREG115_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG115_SWREG_FIELD_0	(0x1u<<0)

// SWREG116 Configuration

#define	VENC_SWREG116_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG116_SWREG_FIELD_0	(0x1u<<0)

// SWREG117 Configuration

#define	VENC_SWREG117_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG117_SWREG_FIELD_0	(0x1u<<0)

// SWREG118 Configuration

#define	VENC_SWREG118_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG118_SWREG_FIELD_0	(0x1u<<0)

// SWREG119 Configuration

#define	VENC_SWREG119_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG119_SWREG_FIELD_0	(0x1u<<0)

// SWREG120 Configuration

#define	VENC_SWREG120_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG120_SWREG_FIELD_0	(0x1u<<0)

// SWREG121 Configuration

#define	VENC_SWREG121_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG121_SWREG_FIELD_0	(0x1u<<0)

// SWREG122 Configuration

#define	VENC_SWREG122_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG122_SWREG_FIELD_0	(0x1u<<0)

// SWREG123 Configuration

#define	VENC_SWREG123_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG123_SWREG_FIELD_0	(0x1u<<0)

// SWREG124 Configuration

#define	VENC_SWREG124_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG124_SWREG_FIELD_0	(0x1u<<0)

// SWREG125 Configuration

#define	VENC_SWREG125_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG125_SWREG_FIELD_0	(0x1u<<0)

// SWREG126 Configuration

#define	VENC_SWREG126_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG126_SWREG_FIELD_0	(0x1u<<0)

// SWREG127 Configuration

#define	VENC_SWREG127_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG127_SWREG_FIELD_0	(0x1u<<0)

// SWREG128 Configuration

#define	VENC_SWREG128_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG128_SWREG_FIELD_0	(0x1u<<0)

// SWREG129 Configuration

#define	VENC_SWREG129_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG129_SWREG_FIELD_0	(0x1u<<0)

// SWREG130 Configuration

#define	VENC_SWREG130_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG130_SWREG_FIELD_0	(0x1u<<0)

// SWREG131 Configuration

#define	VENC_SWREG131_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG131_SWREG_FIELD_0	(0x1u<<0)

// SWREG132 Configuration

#define	VENC_SWREG132_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG132_SWREG_FIELD_0	(0x1u<<0)

// SWREG133 Configuration

#define	VENC_SWREG133_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG133_SWREG_FIELD_0	(0x1u<<0)

// SWREG134 Configuration

#define	VENC_SWREG134_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG134_SWREG_FIELD_0	(0x1u<<0)

// SWREG135 Configuration

#define	VENC_SWREG135_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG135_SWREG_FIELD_0	(0x1u<<0)

// SWREG136 Configuration

#define	VENC_SWREG136_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG136_SWREG_FIELD_0	(0x1u<<0)

// SWREG137 Configuration

#define	VENC_SWREG137_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG137_SWREG_FIELD_0	(0x1u<<0)

// SWREG138 Configuration

#define	VENC_SWREG138_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG138_SWREG_FIELD_0	(0x1u<<0)

// SWREG139 Configuration

#define	VENC_SWREG139_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG139_SWREG_FIELD_0	(0x1u<<0)

// SWREG140 Configuration

#define	VENC_SWREG140_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG140_SWREG_FIELD_0	(0x1u<<0)

// SWREG141 Configuration

#define	VENC_SWREG141_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG141_SWREG_FIELD_0	(0x1u<<0)

// SWREG142 Configuration

#define	VENC_SWREG142_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG142_SWREG_FIELD_0	(0x1u<<0)

// SWREG143 Configuration

#define	VENC_SWREG143_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG143_SWREG_FIELD_0	(0x1u<<0)

// SWREG144 Configuration

#define	VENC_SWREG144_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG144_SWREG_FIELD_0	(0x1u<<0)

// SWREG145 Configuration

#define	VENC_SWREG145_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG145_SWREG_FIELD_0	(0x1u<<0)

// SWREG146 Configuration

#define	VENC_SWREG146_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG146_SWREG_FIELD_0	(0x1u<<0)

// SWREG147 Configuration

#define	VENC_SWREG147_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG147_SWREG_FIELD_0	(0x1u<<0)

// SWREG148 Configuration

#define	VENC_SWREG148_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG148_SWREG_FIELD_0	(0x1u<<0)

// SWREG149 Configuration

#define	VENC_SWREG149_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG149_SWREG_FIELD_0	(0x1u<<0)

// SWREG150 Configuration

#define	VENC_SWREG150_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG150_SWREG_FIELD_0	(0x1u<<0)

// SWREG151 Configuration

#define	VENC_SWREG151_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG151_SWREG_FIELD_0	(0x1u<<0)

