hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_venc.h
// SWREG152 Configuration

#define	VENC_SWREG152_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG152_SWREG_FIELD_0	(0x1u<<0)

// SWREG153 Configuration

#define	VENC_SWREG153_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG153_SWREG_FIELD_0	(0x1u<<0)

// SWREG154 Configuration

#define	VENC_SWREG154_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG154_SWREG_FIELD_0	(0x1u<<0)

// SWREG155 Configuration

#define	VENC_SWREG155_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG155_SWREG_FIELD_0	(0x1u<<0)

// SWREG156 Configuration

#define	VENC_SWREG156_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG156_SWREG_FIELD_0	(0x1u<<0)

// SWREG157 Configuration

#define	VENC_SWREG157_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG157_SWREG_FIELD_0	(0x1u<<0)

// SWREG158 Configuration

#define	VENC_SWREG158_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG158_SWREG_FIELD_0	(0x1u<<0)

// SWREG159 Configuration

#define	VENC_SWREG159_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG159_SWREG_FIELD_0	(0x1u<<0)

// SWREG231 Configuration

#define	VENC_SWREG231_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG231_SWREG_FIELD_0	(0x1u<<0)

// SWREG232 Configuration

#define	VENC_SWREG232_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG232_SWREG_FIELD_0	(0x1u<<0)

// SWREG233 Configuration

#define	VENC_SWREG233_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG233_SWREG_FIELD_0	(0x1u<<0)

// SWREG236 Configuration

#define	VENC_SWREG236_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG236_SWREG_FIELD_0	(0x1u<<0)

// SWREG237 Configuration

#define	VENC_SWREG237_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG237_SWREG_FIELD_0	(0x1u<<0)

// SWREG238 Configuration

#define	VENC_SWREG238_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG238_SWREG_FIELD_0	(0x1u<<0)

// SWREG256 Configuration

#define	VENC_SWREG256_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG256_SWREG_FIELD_0	(0x1u<<0)

// SWREG257 Configuration

#define	VENC_SWREG257_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG257_SWREG_FIELD_0	(0x1u<<0)

// SWREG258 Configuration

#define	VENC_SWREG258_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG258_SWREG_FIELD_0	(0x1u<<0)

// SWREG259 Configuration

#define	VENC_SWREG259_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG259_SWREG_FIELD_0	(0x1u<<0)

// SWREG260 Configuration

#define	VENC_SWREG260_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG260_SWREG_FIELD_0	(0x1u<<0)

// SWREG261 Configuration

#define	VENC_SWREG261_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG261_SWREG_FIELD_0	(0x1u<<0)

// SWREG262 Configuration

#define	VENC_SWREG262_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG262_SWREG_FIELD_0	(0x1u<<0)

// SWREG263 Configuration

#define	VENC_SWREG263_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG263_SWREG_FIELD_0	(0x1u<<0)

// SWREG264 Configuration

#define	VENC_SWREG264_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG264_SWREG_FIELD_0	(0x1u<<0)

// SWREG265 Configuration

#define	VENC_SWREG265_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG265_SWREG_FIELD_0	(0x1u<<0)

// SWREG266 Configuration

#define	VENC_SWREG266_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG266_SWREG_FIELD_0	(0x1u<<0)

// SWREG267 Configuration

#define	VENC_SWREG267_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG267_SWREG_FIELD_0	(0x1u<<0)

// SWREG268 Configuration

#define	VENC_SWREG268_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG268_SWREG_FIELD_0	(0x1u<<0)

// SWREG269 Configuration

#define	VENC_SWREG269_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG269_SWREG_FIELD_0	(0x1u<<0)

// SWREG270 Configuration

#define	VENC_SWREG270_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG270_SWREG_FIELD_0	(0x1u<<0)

// SWREG271 Configuration

#define	VENC_SWREG271_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG271_SWREG_FIELD_0	(0x1u<<0)

// SWREG272 Configuration

#define	VENC_SWREG272_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG272_SWREG_FIELD_0	(0x1u<<0)

// SWREG273 Configuration

#define	VENC_SWREG273_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG273_SWREG_FIELD_0	(0x1u<<0)

// SWREG274 Configuration

#define	VENC_SWREG274_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG274_SWREG_FIELD_0	(0x1u<<0)

// SWREG275 Configuration

#define	VENC_SWREG275_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG275_SWREG_FIELD_0	(0x1u<<0)

// SWREG276 Configuration

#define	VENC_SWREG276_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG276_SWREG_FIELD_0	(0x1u<<0)

// SWREG277 Configuration

#define	VENC_SWREG277_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG277_SWREG_FIELD_0	(0x1u<<0)

// SWREG278 Configuration

#define	VENC_SWREG278_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG278_SWREG_FIELD_0	(0x1u<<0)

// SWREG279 Configuration

#define	VENC_SWREG279_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG279_SWREG_FIELD_0	(0x1u<<0)

// SWREG280 Configuration

#define	VENC_SWREG280_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG280_SWREG_FIELD_0	(0x1u<<0)

// SWREG281 Configuration

#define	VENC_SWREG281_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG281_SWREG_FIELD_0	(0x1u<<0)

// SWREG282 Configuration

#define	VENC_SWREG282_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG282_SWREG_FIELD_0	(0x1u<<0)

// SWREG283 Configuration

#define	VENC_SWREG283_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG283_SWREG_FIELD_0	(0x1u<<0)

// SWREG284 Configuration

#define	VENC_SWREG284_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG284_SWREG_FIELD_0	(0x1u<<0)

// SWREG285 Configuration

#define	VENC_SWREG285_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG285_SWREG_FIELD_0	(0x1u<<0)

// SWREG286 Configuration

#define	VENC_SWREG286_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG286_SWREG_FIELD_0	(0x1u<<0)

// SWREG287 Configuration

#define	VENC_SWREG287_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG287_SWREG_FIELD_0	(0x1u<<0)

// SWREG288 Configuration

#define	VENC_SWREG288_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG288_SWREG_FIELD_0	(0x1u<<0)

// SWREG289 Configuration

#define	VENC_SWREG289_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG289_SWREG_FIELD_0	(0x1u<<0)

// SWREG290 Configuration

#define	VENC_SWREG290_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG290_SWREG_FIELD_0	(0x1u<<0)

// SWREG291 Configuration

#define	VENC_SWREG291_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG291_SWREG_FIELD_0	(0x1u<<0)

// SWREG294 Configuration

#define	VENC_SWREG294_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG294_SWREG_FIELD_0	(0x1u<<0)

// SWREG295 Configuration

#define	VENC_SWREG295_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG295_SWREG_FIELD_0	(0x1u<<0)

// SWREG296 Configuration

#define	VENC_SWREG296_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG296_SWREG_FIELD_0	(0x1u<<0)

// SWREG297 Configuration

#define	VENC_SWREG297_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG297_SWREG_FIELD_0	(0x1u<<0)

// SWREG298 Configuration

