hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_venc.h
#define	VENC_SWREG298_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG298_SWREG_FIELD_0	(0x1u<<0)

// SWREG299 Configuration

#define	VENC_SWREG299_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG299_SWREG_FIELD_0	(0x1u<<0)

// SWREG300 Configuration

#define	VENC_SWREG300_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG300_SWREG_FIELD_0	(0x1u<<0)

// SWREG301 Configuration

#define	VENC_SWREG301_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG301_SWREG_FIELD_0	(0x1u<<0)

// SWREG302 Configuration

#define	VENC_SWREG302_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG302_SWREG_FIELD_0	(0x1u<<0)

// SWREG303 Configuration

#define	VENC_SWREG303_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG303_SWREG_FIELD_0	(0x1u<<0)

// SWREG304 Configuration

#define	VENC_SWREG304_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG304_SWREG_FIELD_0	(0x1u<<0)

// SWREG305 Configuration

#define	VENC_SWREG305_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG305_SWREG_FIELD_0	(0x1u<<0)

// SWREG306 Configuration

#define	VENC_SWREG306_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG306_SWREG_FIELD_0	(0x1u<<0)

// SWREG307 Configuration

#define	VENC_SWREG307_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG307_SWREG_FIELD_0	(0x1u<<0)

// SWREG308 Configuration

#define	VENC_SWREG308_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG308_SWREG_FIELD_0	(0x1u<<0)

// SWREG309 Configuration

#define	VENC_SWREG309_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG309_SWREG_FIELD_0	(0x1u<<0)

// SWREG310 Configuration

#define	VENC_SWREG310_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG310_SWREG_FIELD_0	(0x1u<<0)

// SWREG311 Configuration

#define	VENC_SWREG311_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG311_SWREG_FIELD_0	(0x1u<<0)

// SWREG312 Configuration

#define	VENC_SWREG312_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG312_SWREG_FIELD_0	(0x1u<<0)

// SWREG313 Configuration

#define	VENC_SWREG313_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG313_SWREG_FIELD_0	(0x1u<<0)

// SWREG314 Configuration

#define	VENC_SWREG314_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG314_SWREG_FIELD_0	(0x1u<<0)

// SWREG315 Configuration

#define	VENC_SWREG315_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG315_SWREG_FIELD_0	(0x1u<<0)

// SWREG316 Configuration

#define	VENC_SWREG316_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG316_SWREG_FIELD_0	(0x1u<<0)

// SWREG317 Configuration

#define	VENC_SWREG317_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG317_SWREG_FIELD_0	(0x1u<<0)

// SWREG318 Configuration

#define	VENC_SWREG318_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG318_SWREG_FIELD_0	(0x1u<<0)

// SWREG319 Configuration

#define	VENC_SWREG319_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG319_SWREG_FIELD_0	(0x1u<<0)

// SWREG320 Configuration

#define	VENC_SWREG320_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG320_SWREG_FIELD_0	(0x1u<<0)

// SWREG321 Configuration

#define	VENC_SWREG321_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG321_SWREG_FIELD_0	(0x1u<<0)

// SWREG322 Configuration

#define	VENC_SWREG322_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG322_SWREG_FIELD_0	(0x1u<<0)

// SWREG323 Configuration

#define	VENC_SWREG323_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG323_SWREG_FIELD_0	(0x1u<<0)

// SWREG324 Configuration

#define	VENC_SWREG324_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG324_SWREG_FIELD_0	(0x1u<<0)

// SWREG325 Configuration

#define	VENC_SWREG325_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG325_SWREG_FIELD_0	(0x1u<<0)

// SWREG326 Configuration

#define	VENC_SWREG326_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG326_SWREG_FIELD_0	(0x1u<<0)

// SWREG327 Configuration

#define	VENC_SWREG327_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG327_SWREG_FIELD_0	(0x1u<<0)

// SWREG328 Configuration

#define	VENC_SWREG328_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG328_SWREG_FIELD_0	(0x1u<<0)

// SWREG329 Configuration

#define	VENC_SWREG329_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG329_SWREG_FIELD_0	(0x1u<<0)

// SWREG330 Configuration

#define	VENC_SWREG330_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG330_SWREG_FIELD_0	(0x1u<<0)

// SWREG331 Configuration

#define	VENC_SWREG331_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG331_SWREG_FIELD_0	(0x1u<<0)

// SWREG332 Configuration

#define	VENC_SWREG332_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG332_SWREG_FIELD_0	(0x1u<<0)

// SWREG333 Configuration

#define	VENC_SWREG333_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG333_SWREG_FIELD_0	(0x1u<<0)

// SWREG334 Configuration

#define	VENC_SWREG334_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG334_SWREG_FIELD_0	(0x1u<<0)

// SWREG335 Configuration

#define	VENC_SWREG335_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG335_SWREG_FIELD_0	(0x1u<<0)

// SWREG336 Configuration

#define	VENC_SWREG336_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG336_SWREG_FIELD_0	(0x1u<<0)

// SWREG337 Configuration

#define	VENC_SWREG337_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG337_SWREG_FIELD_0	(0x1u<<0)

// SWREG338 Configuration

#define	VENC_SWREG338_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG338_SWREG_FIELD_0	(0x1u<<0)

// SWREG339 Configuration

#define	VENC_SWREG339_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG339_SWREG_FIELD_0	(0x1u<<0)

// SWREG340 Configuration

#define	VENC_SWREG340_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG340_SWREG_FIELD_0	(0x1u<<0)

// SWREG341 Configuration

#define	VENC_SWREG341_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG341_SWREG_FIELD_0	(0x1u<<0)

// SWREG342 Configuration

#define	VENC_SWREG342_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG342_SWREG_FIELD_0	(0x1u<<0)

// SWREG343 Configuration

#define	VENC_SWREG343_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG343_SWREG_FIELD_0	(0x1u<<0)

// SWREG344 Configuration

#define	VENC_SWREG344_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG344_SWREG_FIELD_0	(0x1u<<0)

// SWREG345 Configuration

#define	VENC_SWREG345_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG345_SWREG_FIELD_0	(0x1u<<0)

// SWREG346 Configuration

#define	VENC_SWREG346_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG346_SWREG_FIELD_0	(0x1u<<0)

// SWREG347 Configuration

#define	VENC_SWREG347_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG347_SWREG_FIELD_0	(0x1u<<0)

