hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_venc.h
// SWREG348 Configuration

#define	VENC_SWREG348_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG348_SWREG_FIELD_0	(0x1u<<0)

// SWREG349 Configuration

#define	VENC_SWREG349_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG349_SWREG_FIELD_0	(0x1u<<0)

// SWREG350 Configuration

#define	VENC_SWREG350_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG350_SWREG_FIELD_0	(0x1u<<0)

// SWREG351 Configuration

#define	VENC_SWREG351_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG351_SWREG_FIELD_0	(0x1u<<0)

// SWREG352 Configuration

#define	VENC_SWREG352_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG352_SWREG_FIELD_0	(0x1u<<0)

// SWREG353 Configuration

#define	VENC_SWREG353_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG353_SWREG_FIELD_0	(0x1u<<0)

// SWREG354 Configuration

#define	VENC_SWREG354_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG354_SWREG_FIELD_0	(0x1u<<0)

// SWREG355 Configuration

#define	VENC_SWREG355_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG355_SWREG_FIELD_0	(0x1u<<0)

// SWREG356 Configuration

#define	VENC_SWREG356_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG356_SWREG_FIELD_0	(0x1u<<0)

// SWREG357 Configuration

#define	VENC_SWREG357_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG357_SWREG_FIELD_0	(0x1u<<0)

// SWREG358 Configuration

#define	VENC_SWREG358_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG358_SWREG_FIELD_0	(0x1u<<0)

// SWREG359 Configuration

#define	VENC_SWREG359_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG359_SWREG_FIELD_0	(0x1u<<0)

// SWREG360 Configuration

#define	VENC_SWREG360_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG360_SWREG_FIELD_0	(0x1u<<0)

// SWREG361 Configuration

#define	VENC_SWREG361_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG361_SWREG_FIELD_0	(0x1u<<0)

// SWREG362 Configuration

#define	VENC_SWREG362_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG362_SWREG_FIELD_0	(0x1u<<0)

// SWREG363 Configuration

#define	VENC_SWREG363_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG363_SWREG_FIELD_0	(0x1u<<0)

// SWREG364 Configuration

#define	VENC_SWREG364_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG364_SWREG_FIELD_0	(0x1u<<0)

// SWREG365 Configuration

#define	VENC_SWREG365_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG365_SWREG_FIELD_0	(0x1u<<0)

// SWREG366 Configuration

#define	VENC_SWREG366_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG366_SWREG_FIELD_0	(0x1u<<0)

// SWREG367 Configuration

#define	VENC_SWREG367_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG367_SWREG_FIELD_0	(0x1u<<0)

// SWREG368 Configuration

#define	VENC_SWREG368_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG368_SWREG_FIELD_0	(0x1u<<0)

// SWREG369 Configuration

#define	VENC_SWREG369_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG369_SWREG_FIELD_0	(0x1u<<0)

// SWREG370 Configuration

#define	VENC_SWREG370_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG370_SWREG_FIELD_0	(0x1u<<0)

// SWREG371 Configuration

#define	VENC_SWREG371_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG371_SWREG_FIELD_0	(0x1u<<0)

// SWREG372 Configuration

#define	VENC_SWREG372_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG372_SWREG_FIELD_0	(0x1u<<0)

// SWREG373 Configuration

#define	VENC_SWREG373_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG373_SWREG_FIELD_0	(0x1u<<0)

// SWREG374 Configuration

#define	VENC_SWREG374_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG374_SWREG_FIELD_0	(0x1u<<0)

// SWREG375 Configuration

#define	VENC_SWREG375_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG375_SWREG_FIELD_0	(0x1u<<0)

// SWREG376 Configuration

#define	VENC_SWREG376_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG376_SWREG_FIELD_0	(0x1u<<0)

// SWREG377 Configuration

#define	VENC_SWREG377_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG377_SWREG_FIELD_0	(0x1u<<0)

// SWREG378 Configuration

#define	VENC_SWREG378_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG378_SWREG_FIELD_0	(0x1u<<0)

// SWREG379 Configuration

#define	VENC_SWREG379_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG379_SWREG_FIELD_0	(0x1u<<0)

// SWREG380 Configuration

#define	VENC_SWREG380_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG380_SWREG_FIELD_0	(0x1u<<0)

// SWREG381 Configuration

#define	VENC_SWREG381_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG381_SWREG_FIELD_0	(0x1u<<0)

// SWREG382 Configuration

#define	VENC_SWREG382_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG382_SWREG_FIELD_0	(0x1u<<0)

// SWREG383 Configuration

#define	VENC_SWREG383_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG383_SWREG_FIELD_0	(0x1u<<0)

// SWREG384 Configuration

#define	VENC_SWREG384_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG384_SWREG_FIELD_0	(0x1u<<0)

// SWREG385 Configuration

#define	VENC_SWREG385_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG385_SWREG_FIELD_0	(0x1u<<0)

// SWREG386 Configuration

#define	VENC_SWREG386_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG386_SWREG_FIELD_0	(0x1u<<0)

// SWREG387 Configuration

#define	VENC_SWREG387_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG387_SWREG_FIELD_0	(0x1u<<0)

// SWREG388 Configuration

#define	VENC_SWREG388_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG388_SWREG_FIELD_0	(0x1u<<0)

// SWREG389 Configuration

#define	VENC_SWREG389_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG389_SWREG_FIELD_0	(0x1u<<0)

// SWREG390 Configuration

#define	VENC_SWREG390_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG390_SWREG_FIELD_0	(0x1u<<0)

// SWREG391 Configuration

#define	VENC_SWREG391_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG391_SWREG_FIELD_0	(0x1u<<0)

// SWREG392 Configuration

#define	VENC_SWREG392_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG392_SWREG_FIELD_0	(0x1u<<0)

// SWREG393 Configuration

#define	VENC_SWREG393_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG393_SWREG_FIELD_0	(0x1u<<0)

// SWREG394 Configuration

#define	VENC_SWREG394_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG394_SWREG_FIELD_0	(0x1u<<0)

// SWREG395 Configuration

#define	VENC_SWREG395_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG395_SWREG_FIELD_0	(0x1u<<0)

