hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_venc.h
// SWREG396 Configuration

#define	VENC_SWREG396_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG396_SWREG_FIELD_0	(0x1u<<0)

// SWREG397 Configuration

#define	VENC_SWREG397_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG397_SWREG_FIELD_0	(0x1u<<0)

// SWREG398 Configuration

#define	VENC_SWREG398_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG398_SWREG_FIELD_0	(0x1u<<0)

// SWREG399 Configuration

#define	VENC_SWREG399_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG399_SWREG_FIELD_0	(0x1u<<0)

// SWREG400 Configuration

#define	VENC_SWREG400_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG400_SWREG_FIELD_0	(0x1u<<0)

// SWREG401 Configuration

#define	VENC_SWREG401_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG401_SWREG_FIELD_0	(0x1u<<0)

// SWREG402 Configuration

#define	VENC_SWREG402_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG402_SWREG_FIELD_0	(0x1u<<0)

// SWREG403 Configuration

#define	VENC_SWREG403_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG403_SWREG_FIELD_0	(0x1u<<0)

// SWREG404 Configuration

#define	VENC_SWREG404_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG404_SWREG_FIELD_0	(0x1u<<0)

// SWREG405 Configuration

#define	VENC_SWREG405_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG405_SWREG_FIELD_0	(0x1u<<0)

// SWREG406 Configuration

#define	VENC_SWREG406_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG406_SWREG_FIELD_0	(0x1u<<0)

// SWREG407 Configuration

#define	VENC_SWREG407_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG407_SWREG_FIELD_0	(0x1u<<0)

// SWREG408 Configuration

#define	VENC_SWREG408_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG408_SWREG_FIELD_0	(0x1u<<0)

// SWREG409 Configuration

#define	VENC_SWREG409_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG409_SWREG_FIELD_0	(0x1u<<0)

// SWREG410 Configuration

#define	VENC_SWREG410_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG410_SWREG_FIELD_0	(0x1u<<0)

// SWREG411 Configuration

#define	VENC_SWREG411_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG411_SWREG_FIELD_0	(0x1u<<0)

// SWREG412 Configuration

#define	VENC_SWREG412_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG412_SWREG_FIELD_0	(0x1u<<0)

// SWREG413 Configuration

#define	VENC_SWREG413_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG413_SWREG_FIELD_0	(0x1u<<0)

// SWREG414 Configuration

#define	VENC_SWREG414_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG414_SWREG_FIELD_0	(0x1u<<0)

// SWREG415 Configuration

#define	VENC_SWREG415_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG415_SWREG_FIELD_0	(0x1u<<0)

// SWREG416 Configuration

#define	VENC_SWREG416_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG416_SWREG_FIELD_0	(0x1u<<0)

// SWREG417 Configuration

#define	VENC_SWREG417_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG417_SWREG_FIELD_0	(0x1u<<0)

// SWREG418 Configuration

#define	VENC_SWREG418_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG418_SWREG_FIELD_0	(0x1u<<0)

// SWREG419 Configuration

#define	VENC_SWREG419_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG419_SWREG_FIELD_0	(0x1u<<0)

// SWREG420 Configuration

#define	VENC_SWREG420_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG420_SWREG_FIELD_0	(0x1u<<0)

// SWREG421 Configuration

#define	VENC_SWREG421_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG421_SWREG_FIELD_0	(0x1u<<0)

// SWREG422 Configuration

#define	VENC_SWREG422_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG422_SWREG_FIELD_0	(0x1u<<0)

// SWREG423 Configuration

#define	VENC_SWREG423_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG423_SWREG_FIELD_0	(0x1u<<0)

// SWREG424 Configuration

#define	VENC_SWREG424_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG424_SWREG_FIELD_0	(0x1u<<0)

// SWREG425 Configuration

#define	VENC_SWREG425_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG425_SWREG_FIELD_0	(0x1u<<0)

// SWREG426 Configuration

#define	VENC_SWREG426_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG426_SWREG_FIELD_0	(0x1u<<0)

// SWREG427 Configuration

#define	VENC_SWREG427_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG427_SWREG_FIELD_0	(0x1u<<0)

// SWREG428 Configuration

#define	VENC_SWREG428_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG428_SWREG_FIELD_0	(0x1u<<0)

// SWREG429 Configuration

#define	VENC_SWREG429_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG429_SWREG_FIELD_0	(0x1u<<0)

// SWREG430 Configuration

#define	VENC_SWREG430_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG430_SWREG_FIELD_0	(0x1u<<0)

// SWREG431 Configuration

#define	VENC_SWREG431_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG431_SWREG_FIELD_0	(0x1u<<0)

// SWREG432 Configuration

#define	VENC_SWREG432_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG432_SWREG_FIELD_0	(0x1u<<0)

// SWREG433 Configuration

#define	VENC_SWREG433_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG433_SWREG_FIELD_0	(0x1u<<0)

// SWREG434 Configuration

#define	VENC_SWREG434_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG434_SWREG_FIELD_0	(0x1u<<0)

// SWREG435 Configuration

#define	VENC_SWREG435_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG435_SWREG_FIELD_0	(0x1u<<0)

// SWREG436 Configuration

#define	VENC_SWREG436_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG436_SWREG_FIELD_0	(0x1u<<0)

// SWREG437 Configuration

#define	VENC_SWREG437_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG437_SWREG_FIELD_0	(0x1u<<0)

// SWREG438 Configuration

#define	VENC_SWREG438_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG438_SWREG_FIELD_0	(0x1u<<0)

// SWREG439 Configuration

#define	VENC_SWREG439_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG439_SWREG_FIELD_0	(0x1u<<0)

// SWREG440 Configuration

#define	VENC_SWREG440_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG440_SWREG_FIELD_0	(0x1u<<0)

// SWREG441 Configuration

#define	VENC_SWREG441_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG441_SWREG_FIELD_0	(0x1u<<0)

// SWREG442 Configuration

#define	VENC_SWREG442_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG442_SWREG_FIELD_0	(0x1u<<0)

// SWREG443 Configuration

#define	VENC_SWREG443_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG443_SWREG_FIELD_0	(0x1u<<0)

// SWREG444 Configuration

#define	VENC_SWREG444_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG444_SWREG_FIELD_0	(0x1u<<0)

// SWREG449 Configuration

#define	VENC_SWREG449_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG449_SWREG_FIELD_0	(0x1u<<0)

// SWREG497 Configuration

#define	VENC_SWREG497_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG497_SWREG_FIELD_0	(0x1u<<0)

// SWREG498 Configuration

#define	VENC_SWREG498_SWREG_FIELD	(0xFFFFFFFFu<<0)
#define	VENC_SWREG498_SWREG_FIELD_0	(0x1u<<0)
